Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.PhasesNumber
The number of electrical phases of the analytical equipment load.
Remarks:
This property is used to retrieve the number of electrical phases.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The number of electrical phases numberOfPhases is not valid, only 1, 3 is valid.
Since:
2025

Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData.PowerFactorState
The PowerFactorState type of the analytical equipment load.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2025